package tw.com.eeit94.textile.model.example;

/**
 * 1. 這個程式純粹放註解，沒小用。
 * 
 * 2. 我打的註解看完後拜託不要留，留你的註解就好了，最好在類別、屬性和方法上留Javadoc的註解，類別上的一定要留。
 * 
 * 3. 所有Java程式儘量要用eclipse自動排版，JSP不一定要(因為有bug)。
 * 
 * 4. 有關資料庫連線的資料放在Servers/context.xml，不要放在META-INF/context.xml，因為每個人的不同，用Git會一直有衝突。
 * 
 * 5. 所有組態檔(作者標「共同」的)，如果有要新增什麼我改就好了，不然用Git會一直有衝突。(然後不要自己新增任何的xml檔)
 * 
 * 6. 為了讓別人和以後的你看得懂XD，這裡一定要打摘要，程式有些地方也要自己加註解，參考所有example的檔案或我的程式。
 * 
 * 7. 因為太多東西，有些地方剛開始我沒說好，程式有些小地方我有改，儘量配合，如果看不懂或因為規則導致你的bug解不開跟我說，我會幫忙QQ。
 * 
 * 8. 我把測試程式移到Test，麻煩再測試一次，測試程式全部不能註解掉，要確定任何時刻執行都能成功才有意義。不用怕表格被更新，每次測試完用整合的sql檔刷表格就好了。
 * 
 * 9. 程式要自動排版，黃虛虛拜託想辦法清掉(不要亂用eclipse功能亂清)。
 * 
 * 10. 拜託一定要重新看一次所有的example檔案，做好Controller的就做前端(功能先出來)，我後端整合好會馬上支援。
 * 
 * 11. 如果到時候有些人在做單機測試時，讓Git忽略Spring的檔案不要上傳，讓remote repository的Spring組態保持線上模式。
 * 
 * 12. 有新的規則會再通知，希望沒有= =。
 * 
 * @author 賴
 * @version 2017/06/12
 */
public class Example {

}