package tw.com.eeit94.textile.model.interest_detail;

/**
 * 定義一對一表單的資料與Interest_Detail表格主鍵的Map鍵值對應。
 * 
 * 因為現在表單第n個checkbox的興趣就是primary key n，
 * 
 * 但之後若更動表單興趣名稱和次序，則只要更改這個類別並做一些後續處理即可。
 * 
 * ！！！！！！不要使用自動排版！！！！！！
 * 
 * ！！！！！！不要使用自動排版！！！！！！
 * 
 * ！！！！！！不要使用自動排版！！！！！！
 * 
 * @author 賴
 * @version 2017/06/19
 */
public enum ConstInterest_DetailKey {
	i1("i1", 1, 1),
	i2("i2", 2, 1),
	i3("i3", 3, 1),
	i4("i4", 4, 1),
	i5("i5", 5, 1),
	i6("i6", 6, 1),
	i7("i7", 7, 1),
	i8("i8", 8, 1),
	i9("i9", 9, 2),
	i10("i10", 10, 2),
	i11("i11", 11, 2),
	i12("i12", 12, 2),
	i13("i13", 13, 2),
	i14("i14", 14, 2),
	i15("i15", 15, 2),
	i16("i16", 16, 2),
	i17("i17", 17, 3),
	i18("i18", 18, 3),
	i19("i19", 19, 3),
	i20("i20", 20, 3),
	i21("i21", 21, 3),
	i22("i22", 22, 3),
	i23("i23", 23, 3),
	i24("i24", 24, 3),
	i25("i25", 25, 4),
	i26("i26", 26, 4),
	i27("i27", 27, 4),
	i28("i28", 28, 4),
	i29("i29", 29, 4),
	i30("i30", 30, 4),
	i31("i31", 31, 4),
	i32("i32", 32, 4),
	i33("i33", 33, 5),
	i34("i34", 34, 5),
	i35("i35", 35, 5),
	i36("i36", 36, 5),
	i37("i37", 37, 5),
	i38("i38", 38, 5),
	i39("i39", 39, 5),
	i40("i40", 40, 5),
	i41("i41", 41, 6),
	i42("i42", 42, 6),
	i43("i43", 43, 6),
	i44("i44", 44, 6),
	i45("i45", 45, 6),
	i46("i46", 46, 6),
	i47("i47", 47, 6),
	i48("i48", 48, 6),
	i49("i49", 49, 7),
	i50("i50", 50, 7),
	i51("i51", 51, 7),
	i52("i52", 52, 7),
	i53("i53", 53, 7),
	i54("i54", 54, 7),
	i55("i55", 55, 7),
	i56("i56", 56, 7),
	i57("i57", 57, 8),
	i58("i58", 58, 8),
	i59("i59", 59, 8),
	i60("i60", 60, 8),
	i61("i61", 61, 8),
	i62("i62", 62, 8),
	i63("i63", 63, 8),
	i64("i64", 64, 8),
	o1("o1", 0, 1),
	o2("o2", 0, 1),
	o3("o3", 0, 1),
	o4("o4", 0, 1),
	o5("o5", 0, 1),
	o6("o6", 0, 2),
	o7("o7", 0, 2),
	o8("o8", 0, 2),
	o9("o9", 0, 2),
	o10("o10", 0, 2),
	o11("o11", 0, 3),
	o12("o12", 0, 3),
	o13("o13", 0, 3),
	o14("o14", 0, 3),
	o15("o15", 0, 3),
	o16("o16", 0, 4),
	o17("o17", 0, 4),
	o18("o18", 0, 4),
	o19("o19", 0, 4),
	o20("o20", 0, 4),
	o21("o21", 0, 5),
	o22("o22", 0, 5),
	o23("o23", 0, 5),
	o24("o24", 0, 5),
	o25("o25", 0, 5),
	o26("o26", 0, 6),
	o27("o27", 0, 6),
	o28("o28", 0, 6),
	o29("o29", 0, 6),
	o30("o30", 0, 6),
	o31("o31", 0, 7),
	o32("o32", 0, 7),
	o33("o33", 0, 7),
	o34("o34", 0, 7),
	o35("o35", 0, 7),
	o36("o36", 0, 8),
	o37("o37", 0, 8),
	o38("o38", 0, 8),
	o39("o39", 0, 8),
	o40("o40", 0, 8);

	/**
	 * key：興趣明細表單checkbox的name。
	 * 
	 * primaryKey：興趣明細表單checkbox所對應目前興趣名稱的primary key。
	 * 
	 * category：興趣明細表單checkbox所在的興趣分類。
	 * 
	 * i1~i8為第1類，i9~i16為第2類，以此類推，o1~o5(其它)為第1類，o6~o10(其它)為第2類，以此類推。
	 * 
	 * @author 賴
	 * @version 2017/06/19
	 */
	private final String key;
	private final int primaryKey;
	private final int category;

	ConstInterest_DetailKey(String key, int primaryKey, int category) {
		this.key = key;
		this.primaryKey = primaryKey;
		this.category = category;
	}

	public String key() {
		return this.key;
	}

	public int primaryKey() {
		return this.primaryKey;
	}

	public int category() {
		return this.category;
	}
}